---
lab:
  title: 练习 06 - 在 Microsoft Sentinel 中执行威胁搜寻
  module: Guided Project - Create detections and perform investigations using Microsoft Sentinel
---

## 练习概述

你是一位安全运营分析师，所在公司已实现 Microsoft Sentinel。 你需要了解如何使用 Microsoft Sentinel 检测和缓解威胁。 将数据源连接到 Microsoft Sentinel 后，可以创建自定义分析规则来帮助发现环境中的威胁和异常行为。

威胁搜寻查询支持并授权 SOC 分析师在潜在攻击发生时或发生之前主动对其进行监视和调查。 在 Microsoft Sentinel 中搜寻允许使用类似于分析规则的查询来审核环境是否存在潜在的恶意活动，同时允许分析师根据需要将结果升级为事件。 有时，搜寻威胁可能需要超出分析（热）层保留期的数据，这时可以使用搜索/还原作业等功能来确保 SOC 具有所需的数据。

## 练习说明

### 任务 1：创建搜寻查询

在此任务中，你将创建一个搜索查询并将结果加入书签。

1. 使用以下密码以管理员身份登录到 WIN1 虚拟机：**Pa55w.rd**。  

1. 在 Microsoft Edge 浏览器中，导航到 Azure 门户 (<https://portal.azure.com> )。

1. 在“登录”对话框中，复制粘贴实验室托管提供者提供的租户电子邮件帐户，然后选择“下一步”  。

1. 在“输入密码”对话框中，复制粘贴实验室托管提供者提供的租户密码，然后选择“登录”  。

1. 在 Azure 门户的搜索栏中，键入“Sentinel”，然后选择“Microsoft Sentinel”。

1. 选择 Microsoft Sentinel 工作区。

1. 选择“日志”

1. 在“新查询 1”空间输入以下 KQL 语句：

   >**重要提示：** 请首先将任意 KQL 查询粘贴到记事本，然后从此处复制到“新建查询 1 日志”窗口以避免任何错误。

    ```KQL
    let lookback = 2d; 
    SecurityEvent 
    | where TimeGenerated >= ago(lookback) 
    | where EventID == 4688 and Process =~ "powershell.exe"
    | extend PwshParam = trim(@"[^/\\]*powershell(.exe)+" , CommandLine) 
    | project TimeGenerated, Computer, SubjectUserName, PwshParam 
    | summarize min(TimeGenerated), count() by Computer, SubjectUserName, PwshParam 
    | order by count_ desc nulls last 
    ```
